# 6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета не обязательно
# были все типы занятий. Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести
# словарь на экран.
# Примеры строк файла:
#
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
# Пример словаря:
#
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

mydict = {}

with open("6", "r", encoding='utf-8') as file:
    lines = file.readlines()
    for line in lines:
        line_list = line.split()
        mydict[line_list[0][:-1]] = sum([int(x[:x.find('(')]) for x in line_list[1:] if '(' in x])

print(mydict)
